import React from 'react'

// Styles
import styles from './index.module.scss'

// Images
import historyImg1 from '../../assets/images/historyImg1.png'
import historyImg2 from '../../assets/images/historyImg2.png'
import historyImg3 from '../../assets/images/historyImg3.png'

// Components
import Title from '../../modules/Title/Title'

const History = () => {
    return (
        <div className={styles.history}>
            <div className='container'>
                <div className={styles.historyTitle}>
                    <Title contents={'Історія кафедри'} center />
                </div>
                <div className={styles.historyContent}>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Стрімкий розвиток комп'ютерної техніки з кінця 60-х - початку 70-х років обумовив гостру потребу у висококваліфікованих фахівцях у галузі електронно-обчислювальних машин. Спеціальність «Математичні та лічильно-розв'язувальні прилади та пристрої», в рамках якої в той період вивчалися в основному механічні пристрої та аналогові машини, потребувала кардинальних змін. У 1970 році у Вінницькому політехнічному інституту було оголошено перший набір студентів на спеціальність «Електронні обчислювальні машини».
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Для підготовки фахівців по новій спеціальності у 1972 році на базі кафедри «Електронних приладів» було створено нову кафедру, яка отримала назву «Обчислювальної техніки». Виконувати обов'язки завідувача було покладено на к.т.н., доцента Деля В.Д. Першими викладачами кафедри були Кожем'яко В.П., Пєтух А.М., Квітка М.А., Рудомін Г.А. Пізніше до них приєднались к.т.н. Данилюк Ю.С, к.т.н. Ліхтциндер Б.Я., к.т.н. Байда М.П., Головань Т.В., Грабчак О. В., Ільницький М. П., Задорожний В. К., Очкуров М.А., Смольков Є. О. та ін.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <img className={styles.historyImg} src={historyImg1} alt='history image'/>
                        <div className={styles.historyImgText}>
                            Викладачі кафедри ОТ (1977 р.)
                        </div>
                        <div className={styles.historyImgSubtext}>
                            Верхній ряд (зліва направо): Кожем’яко В. П., Грабчак О. В., Байда М. П., Обідник Д. Т.
                        </div>
                        <div className={styles.historyImgSubtext}>
                            Нижній ряд (зліва направо): Очкуров М. А., Задорожний В. К., Стахов О. П., Ліхтціндер Б. Я., Пєтух А. М.
                        </div>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            В подальшому викладачами кафедри ОТ стали випускники спеціальності «Електронні обчислювальні машини» 70-80-х років: Обідник Д. Т., Кондратенко Н. Р., Черняк О.І., Семеренко В. П., Гороховський О. І., Панич Н. М., Сілагін О. В., Тарасова О. М., Біліченко Н.О. та інші. У теперішній час ветеранами кафедри є: Азаров О.Д., Очкуров М. А., Семеренко В. П., Черняк О. І.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Кафедру очолювали:
                        </p>
                        <ul className={styles.historyList}>
                            <li className={styles.historyListItem}>
                                з вересня 1972 р. по червень 1976 року - к.т.н., доцент Дель В. Д.,
                            </li>
                            <li className={styles.historyListItem}>
                                з червня 1976 року по лютий 1977 року - к.т.н., доцент Ліхтциндер Б. Я.,
                            </li>
                            <li className={styles.historyListItem}>
                                з лютого 1977 року по грудень 1977 року - к.т.н., доцент Данилюк Ю. С,
                            </li>
                            <li className={styles.historyListItem}>
                                з грудня 1977 року по листопад 1988 року - д.т.н., професор Стахов О. П.,
                            </li>
                            <li className={styles.historyListItem}>
                                з листопада 1988 року по травень 1993 року - к.т.н., доцент Азаров О. Д.,
                            </li>
                            <li className={styles.historyListItem}>
                                з травня 1993 по червень 1995 року - д.т.н., професор Байда М. П.,
                            </li>
                            <li className={styles.historyListItem}>
                                з червня 1995 року по теперішній час - д.т.н., професор Азаров О. Д.,
                            </li>
                            <li className={styles.historyListItem}>
                                з лютого 2015 по січень 2016 року - к.т.н., доцент Гороховський О. І.,
                            </li>
                            <li className={styles.historyListItem}>
                                з січня 2016 року  по квітень 2016 р - к.т.н., доцент Крупельницький Л. В.,
                            </li>
                            <li className={styles.historyListItem}>
                                з квітня 2016 р. по теперішній час - д.т.н., професор Мартинюк Т.Б.
                            </li>
                        </ul>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Через аспірантуру, докторантуру та інститут пошукувачів, починаючи з 1979 року на кафедрі ОТ захищено 6 докторських дисертацій (Ліхтциндер Б. Я. (1979 р.), Кожем’яко В. П. (1989 р.), Пєтух А.М.(1992 р.), Азаров О. Д.(1995 р.), Лужецький В.А.(2004 р.), Перевозніков С.І.(2006 р.)) та більше 50 кандидатських дисертацій.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            З часу утворення кафедри підготовлені кандидати технічних наук: Кожем’яко В. П. (1977 р.), Азаров О. Д.(1980 р.), Соляниченко М. О.(1980 р.), Оводенко О. В.(1980 р.), Лужецький В. А.(1981 р.), Грабчак О. В. (1982 р.), Обідник Д. Т.(1983 р.), Шпілєвой В. Т. (1983 р.), Задорожний В. К.(1984 р.), Марценюк В. П.(1984 р.), Паніч Н. М.(1984 р.), Петросюк Ю. А.(1984 р.), Тимченко Л. І. (1984 р.), Моісєєв В. І.(1985 р.), Сілагін О. В.(1985 р.), Сторожук Ю. О.(1985 р.), Орлович Ю. П. (1987 р.), Романюк О. Н.(1988 р.), Стейскал В. Я.(1988 р.), Замчевський В. В. (1989 р.), Кліменко Ю. П. (1990 р.), Умрам Басім (1990 р.), Стахов Д. О.(1992 р.), Крупельницький Л. В.(1994 р.), Денисюк В. О.(1996 р.), Конате Карім(1996р.), Захарченко С. М.(1997 р.), Коваленко О. О.(1997 р.), Ракитянська Г. Б.(1998 р.), Аль-Майта Мохаммад Абделькарім(1999 р.), Омар Абдаллах Фалех Аль Хіясат(1999 р.), Яремчук Ю.Є.(2000 р.), Біліченко Н.О.(2001 р.), Шапошніков О.В.(2004 р.), Архіпчук О.А.(2005 р.), Куземко С.М.(2006 р.), Снігур А.В.(2008 р.), Харьков О.М.(2009 р.), Кадук О.В.(2010 р.), Чеборака О.О.(2010 р.), Гарнага В.А.(2011 р.), Решетнік О.О.(2011 р.), Богомолов С. В.(2012 р.), Хрущак С. В.(2012 р.), Бойко О. В.(2013 р.), Черняк О. І.(2013 р.), Дудник О. В.(2013 р. ), Трояновська Т. І. (2014 р.),  Теплицький М. Ю. (2014 р.), Савицька Л. А.  (2015 р.), Грійо-Тукало О. Ф. (2016 р.).
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Кафедрою з початку її створення підготовлено понад 3000 спеціалістів, у тому числі 203 особи для 36 зарубіжних країн.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <img className={styles.historyImg} src={historyImg2} alt='history image'/>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            На кафедрі ведеться підготовка спеціалістів для країн далекого зарубіжжя. У різний час тут навчалися студенти з Анголи, Бангладеш, Болівії, Гвінеї, Індії, Йемену, Йорданії, Кенії, Колумбії, Конго, Лівану, Мозамбіку, Анголи, Сенегалу, Сирії, Судану, Шрі-Ланки, Камеруну, Еквадору, Китаю та інших країн.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            На базі кафедри ОТ у різні часи було створено ще 5 кафедр, а саме: автоматизованих систем управління, проектування комп'ютерної техніки, інтелектуальних систем (тепер комп’ютерних наук), програмного забезпечення, захисту інформації. В 1982 році на базі кафедри ОТ був створений відділ обчислювальних систем на СКТБ «Модуль» ВПІ, який тепер функціонує як НТЦ «Аналого-цифрові системи» ВНТУ.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            У 1989 р. на кафедрі відповідно до спільного наказу АН УРСР та МВССО УРСР №356/184 від 14.07.1989 р. було створено лабораторію відмовостійких обчислювальних і керуючих систем НАН України та МОН України. Ця лабораторія є спільною науково-дослідною лабораторією Інституту кібернетики імені В. М. Глушкова НАН України, кафедри обчислювальної техніки ВНТУ та науково-технічного центру “Аналого-цифрові системи” ВНТУ.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            На кафедрі в 2017-2018 навчальному році працюють 18 штатних викладачів та 4 викладачі за сумісництвом. Серед них - 3 професори, 14 доцентів, 3 старших викладачів та 2 асистентів. 20 викладачів кафедри є випускниками ВНТУ.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Викладачі і співробітники кафедри постійно підвищують свою кваліфікацію за допомогою семінару підвищення педагогічної майстерності, а також на авторизованому навчальному центрі фірм Microsoft, Novel та Sun Microsystems, корпорації «Квазар Мікро» (м. Київ) та науково-навчальному комп’ютерному центрі перспективних інформаційних технологій ФІІТКІ.
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Кафедра обчислювальної техніки функціонує у структурі факультету інформаційних технологій та комп’ютерної інженерії (ФІТКІ) і випускає фахівців (бакалаврів, спеціалістів, магістрів та докторів філософії) з напряму підготовки  123 – «Комп’ютерна інженерія».
                        </p>
                    </div>
                    <div className={styles.historyItem}>
                        <p className={styles.historyParagraph}>
                            Кафедру обладнано сучасною навчально-лабораторною базою. До її складу входять:
                        </p>
                        <ul className={styles.historyList}>
                            <li className={styles.historyListItem}>
                                Лабораторія комп’ютерної електроніки та комп’ютерної схемотехніки.
                            </li>
                            <li className={styles.historyListItem}>
                                Лабораторія комп’ютерних систем і мереж.
                            </li>
                            <li className={styles.historyListItem}>
                                Лабораторія автоматизації проектування засобів обчислювальної техніки.
                            </li>
                            <li className={styles.historyListItem}>
                                Лабораторія програмного забезпечення засобів обчислювальної техніки.
                            </li>
                            <li className={styles.historyListItem}>
                                Науково-технічний центр «Аналого-цифрові системи».
                            </li>
                            <li className={styles.historyListItem}>
                                Науково-дослідна лабораторія високопродуктивних відмовостійких інформаційно-обчислювальних і керуючих систем (спільно з ІК НАНУ).
                            </li>
                        </ul>
                    </div>
                    <div className={styles.historyItem}>
                        <img className={styles.historyImg} src={historyImg3} alt='history image'/>
                        <div className={styles.historyImgText}>
                            Колектив кафедри ОТ після урочистого засідання з нагоди 45-річного ювілею  (Жовтень 2017 р.)
                        </div>
                        <div className={styles.historyImgSubtext}>
                            Зліва направо: Богомолов С. В., Тукало А. Б., Колесник І. С., Снігур А. В., Цирульник С. М., Люта Л. І., Савицька Л. А., Захарченко С. М., Гарнага В. А., Трояновська Т, І., Тарасова О. М., Азаров О. П., Кадук О. В., Крупельницький Л. В., Обертюх М. Р., Ткаченко О. М., Очкуров М. А., Семеренко В. П., Черняк О. І.
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default History
